nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  # s: [0.50, 0.50, 1024]
  # m: [0.50, 1.00, 512]
  # l: [1.00, 1.00, 512]
  # x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]           # 0  - P1/2
  - [-1, 1, Conv,  [128, 3, 2]]           # 1  - P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]    # 2
  - [-1, 1, RAFM1,  [256]]                 # 3  ← RAFM on P2 features
  - [-1, 1, Conv,  [256, 3, 2]]           # 4  - P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]    # 5
  - [-1, 1, RAFM1,  [512]]                 # 6  ← RAFM on P3 features
  - [-1, 1, Conv,  [512, 3, 2]]           # 7  - P4/16
  - [-1, 2, C3k2,  [512, True]]           # 8  ← P4 anchor
  - [-1, 1, Conv,  [1024, 3, 2]]          # 9  - P5/32
  - [-1, 2, C3k2,  [1024, True]]          # 10
  - [-1, 1, SPPF,  [1024, 5, 3, True]]   # 11
  - [-1, 2, C2PSA, [1024]]               # 12 ← P5 anchor

head:
  - [-1,       1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 8],  1, Concat, [1]]                         # 14 - cat P4 (was 6, now 8)
  - [-1,       2, C3k2, [512, True]]                   # 15 (was 13)
  - [-1,       1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 6],  1, Concat, [1]]                         # 17 - cat P3 (was 4, now 6 RAFM)
  - [-1,       2, C3k2, [256, True]]                   # 18 (was 16) ← Detect P3
  - [-1,       1, Conv, [256, 3, 2]]                   # 19
  - [[-1, 15], 1, Concat, [1]]                         # 20 - cat neck P4 (was 13, now 15)
  - [-1,       2, C3k2, [512, True]]                   # 21 (was 19) ← Detect P4
  - [-1,       1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 12], 1, Concat, [1]]                         # 23 - cat P5 (was 10, now 12)
  - [-1,       1, C3k2, [1024, True, 0.5, True]]       # 24 (was 22) ← Detect P5
  - [[18, 21, 24], 1, Detect, [nc]]                    # 25 (was [16,19,22])